In [1]:
% load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

In [3]:
%%sql

CREATE TABLE EMPLOYEES (
                            EMP_ID CHAR(9) NOT NULL, 
                            F_NAME VARCHAR(15) NOT NULL,
                            L_NAME VARCHAR(15) NOT NULL,
                            SSN CHAR(9),
                            B_DATE DATE,
                            SEX CHAR,
                            ADDRESS VARCHAR(30),
                            JOB_ID CHAR(9),
                            SALARY DECIMAL(10,2),
                            MANAGER_ID CHAR(9),
                            DEP_ID CHAR(9) NOT NULL,
                            PRIMARY KEY (EMP_ID));

 * sqlite://
Done.

[]

In [4]:
%%sql 

CREATE TABLE DEPARTMENTS (
                            DEPT_ID_DEP CHAR(9) NOT NULL, 
                            DEP_NAME VARCHAR(15) ,
                            MANAGER_ID CHAR(9),
                            LOC_ID CHAR(9),
                            PRIMARY KEY (DEPT_ID_DEP));

 * sqlite://
Done.

[]

In [5]:
%%sql

insert into EMPLOYEES
(EMP_ID, F_NAME, L_NAME, SSN, B_DATE, SEX, ADDRESS, JOB_ID, SALARY, MANAGER_ID, DEP_ID)
VALUES
('E1001','John', 'Thomas','123456','01/09/1976','M','"5631 Rice, OakPark,IL"','100','100000','30001','2'),
('E1002','Alice','James','123457','07/31/1972','F',"980 Berry ln, Elgin,IL",'200','80000','30002','5'),
('E1003','Steve','Wells','123458','08/10/1980','M',"291 Springs, Gary,IL",'300','50000','30002','5'),
('E1004','Santosh','Kumar','123459','07/20/1985','M',"511 Aurora Av, Aurora,IL",'400','60000','30004','5'),
('E1005','Ahmed','Hussain','123410','01/04/1981','M',"216 Oak Tree, Geneva,IL",'500','70000','30001','2'),
('E1006','Nancy','Allen','123411','02/06/1978','F',"111 Green Pl, Elgin,IL",'600','90000','30001','2'),
('E1007','Mary','Thomas','123412','05/05/1975','F',"100 Rose Pl, Gary,IL",'650','65000','30003','7'),
('E1008','Bharath','Gupta','123413','05/06/1985','M',"145 Berry Ln, Naperville,IL",'660','65000','30003','7'),
('E1009','Andrea','Jones','123414','07/09/1990','F',"120 Fall Creek, Gary,IL",'234','70000','30003','7'),
('E1010','Ann','Jacob','123415','03/30/1982','F',"111 Britany Springs,Elgin,IL",'220','70000','30004','5')

 * sqlite://
10 rows affected.

[]

In [6]:
%%sql

insert into DEPARTMENTS
(DEPT_ID_DEP, DEP_NAME, MANAGER_ID, LOC_ID)
VALUES
('2','Architect Group','30001','L0001'),
('5','Software Group','30002','L0002'),
('7','Design Team','30003','L0003')

 * sqlite://
3 rows affected.

[]

In [9]:
%%sql 

select * from EMPLOYEES;

 * sqlite://
Done.

[('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '"5631 Rice, OakPark,IL"', '100', 100000, '30001', '2'),
 ('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5'),
 ('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5'),
 ('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5'),
 ('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2'),
 ('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2'),
 ('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7'),
 ('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7'),
 ('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7'),
 ('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')]

In [15]:
%%sql

select AVG(SALARY)
from EMPLOYEES

 * sqlite://
Done.

[(72000.0,)]

In [16]:
%%sql

select * from EMPLOYEES
where SALARY > AVG(SALARY)

 * sqlite://
(sqlite3.OperationalError) misuse of aggregate function AVG() [SQL: 'select * from EMPLOYEES\nwhere SALARY > AVG(SALARY)'] (Background on this error at: http://sqlalche.me/e/e3q8)

## Agregate functions can't be always evaluated in the where clause

### To solve this:

In [18]:
%%sql

select * from EMPLOYEES
where SALARY > (select AVG(SALARY) from EMPLOYEES);

 * sqlite://
Done.

[('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '"5631 Rice, OakPark,IL"', '100', 100000, '30001', '2'),
 ('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5'),
 ('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2')]

In [19]:
%%sql

select EMP_ID, SALARY, AVG(SALARY) as AVG_SALARY
from employees;

 * sqlite://
Done.

[('E1010', 70000, 72000.0)]

## Not what we want

### But running like this ...

In [21]:
%%sql

select EMP_ID, SALARY,
(select AVG(SALARY) from EMPLOYEES)
from EMPLOYEES;

 * sqlite://
Done.

[('E1001', 100000, 72000.0),
 ('E1002', 80000, 72000.0),
 ('E1003', 50000, 72000.0),
 ('E1004', 60000, 72000.0),
 ('E1005', 70000, 72000.0),
 ('E1006', 90000, 72000.0),
 ('E1007', 65000, 72000.0),
 ('E1008', 65000, 72000.0),
 ('E1009', 70000, 72000.0),
 ('E1010', 70000, 72000.0)]

## Derived tables (Usefull when dealing with more than 1 table at once)

In [22]:
%%sql

select * from 
(select EMP_ID, F_NAME, L_NAME, DEP_ID from EMPLOYEES) 
as empall

 * sqlite://
Done.

[('E1001', 'John', 'Thomas', '2'),
 ('E1002', 'Alice', 'James', '5'),
 ('E1003', 'Steve', 'Wells', '5'),
 ('E1004', 'Santosh', 'Kumar', '5'),
 ('E1005', 'Ahmed', 'Hussain', '2'),
 ('E1006', 'Nancy', 'Allen', '2'),
 ('E1007', 'Mary', 'Thomas', '7'),
 ('E1008', 'Bharath', 'Gupta', '7'),
 ('E1009', 'Andrea', 'Jones', '7'),
 ('E1010', 'Ann', 'Jacob', '5')]